////// __________________________________________________
//// СТВОРЕННЯ ЗМІННОЇ
// let arr;//спосіб створення змінної

//// ВИКЛИК ЇЇ ТА НАПОВЕННЯ ЇЇ МАСИВОМ З РІЗНОВИДОМ ЗМІННИХ

// arr = [123, 234, 345, -123, true, 'qqqqq'];
// виклик змінної, створення масиву
// та наповнення стрінгою числом  та булевим значеннями
// console.log(arr)//вивід масиву в консоль
// console.log(arr[0])//вивід першого значення в консоль
// console.log(arr[2])//вивід третього значення в консоль
// console.log(arr.length)//вивід довжини масиву кількість значень в ньому

//// ДОДАВАННЯ ЕЛЕМЕНТІВ РІЗНИМИ СПОСОБАМИ(НА ПОЧАТОК МАСИВУ В КІНЕЦЬ ТА ІНШЕ)
// arr[0] = 'new value';// додавання нового значення до масиву на початок
// console.log(arr);//вивід в консоль довжина значень ==7
// arr[7] = 'kokten';//виклик змінної додавання до нього значення в кінець масиву
// console.log(arr)//вивід в консоль довжина тепер 8 індекс= 7
// arr[arr.length] = 1293883;//ще один спосіб додавання елементу в кінець масиву
// console.log(arr)
// arr[arr.length] = 'aiffysadf';//ще один спосіб додавання елементу в кінець масиву
// console.log(arr)
////// ___________________________________________________
/////Створення та наповнення багатовимірного масиву
// let arr=[
//     [11,22,33]
//     [],
//     []
// ];
// console.log(arr)
///
///Створення нової змінної перевизначення її та вклад масиву з багато та виклик в консоль
let innerArray=arr[0]///перевизначення масиву та вклад в нього масиву з індексом 0